---
kind: property
id: P:Autodesk.Revit.DB.Electrical.CableTrayConduitBase.RunId
source: html/6e83aa34-591d-a91f-cebc-1bf7e28d2e6c.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayConduitBase.RunId Property

The id of the run to which this element belongs.

## Syntax (C#)
```csharp
public ElementId RunId { get; }
```